<a href="https://colab.research.google.com/github/yoonyoung27/prac_class/blob/main/team_quiz.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

#team quiz
Make a program that produce 'new_data.txt' with IDs listed in ids.txt.

###① Codes for data generation

In [1]:
with open('ids.txt', 'w') as f :
    f.write('ID\nJohn\nKarl\nAndy\nTim\n')

In [2]:
with open('data1.txt', 'w') as f :
    f.write('ID\tfield1\tfield2\tfield3\nTom\t1\t3\t1\nJohn\t1\t3\t3\nTom\t1\t1\t1\nKarl\t1\t1\t2\nKarl\t1\t3\t2\nKarl\t2\t2\t2\nAndy\t1\t2\t3')

In [3]:
with open('data2.txt', 'w') as f :
    f.write('ID\tfield1\tfield2\tfield3\nTom\t2\t3\t1\nJane\t1\t1\t3\nJane\t2\t2\t1\nMax\t3\t1\t2\nKarl\t1\t4\t2\nMax\t3\t2\t2\nMax\t2\t2\t1')

###② How to read ids

In [4]:
### Hint1

ids = []
with open("ids.txt", encoding='utf-8') as f:
    for item in f:
        ids.append(item.strip())

In [5]:
### Hint 2

with open("data1.txt", encoding='utf-8') as f:
  for item in f :
    nm, f1, f2, f3 = item.strip().split()
    print("nm: {}, f1: {}, f2: {}, f3: {}".format(nm, f1,f2,f3) )

nm: ID, f1: field1, f2: field2, f3: field3
nm: Tom, f1: 1, f2: 3, f3: 1
nm: John, f1: 1, f2: 3, f3: 3
nm: Tom, f1: 1, f2: 1, f3: 1
nm: Karl, f1: 1, f2: 1, f3: 2
nm: Karl, f1: 1, f2: 3, f3: 2
nm: Karl, f1: 2, f2: 2, f3: 2
nm: Andy, f1: 1, f2: 2, f3: 3

* strip() 메서드는 \n을 기준으로 나누는 역할이고, split() 메서드는 \t를 기준으로 나누는 역할인가?

###③ write 'new_data.txt' file

In [9]:
with open('new_data.txt', 'w') as fw :
    with open("data1.txt", encoding='utf-8') as f:
        for item in f :
            nm, f1, f2, f3 = item.strip().split()
            if nm in ids :
                fw.write(item)

    fw.write("\n")

    with open("data2.txt", encoding='utf-8') as f:
        for item in f :
            nm, f1, f2, f3 = item.strip().split()
        if nm in ids[1:] :
            fw.write(item)

with open("new_data.txt", encoding='utf-8') as f:
    for item in f :
        print(item)

ID	field1	field2	field3

John	1	3	3

Karl	1	1	2

Karl	1	3	2

Karl	2	2	2

Andy	1	2	3

###* Using Pandas

In [10]:
import pandas as pd

ids = pd.read_csv('ids.txt', delimiter = "\t")
data1 = pd.read_csv('data1.txt', delimiter = "\t")
data2 = pd.read_csv('data2.txt', delimiter = "\t")

In [14]:
ids

     ID
0  John
1  Karl
2  Andy
3   Tim

In [13]:
list(ids['ID'])

['John', 'Karl', 'Andy', 'Tim']

In [15]:
data1

     ID  field1  field2  field3
0   Tom       1       3       1
1  John       1       3       3
2   Tom       1       1       1
3  Karl       1       1       2
4  Karl       1       3       2
5  Karl       2       2       2
6  Andy       1       2       3

In [16]:
data2

     ID  field1  field2  field3
0   Tom       2       3       1
1  Jane       1       1       3
2  Jane       2       2       1
3   Max       3       1       2
4  Karl       1       4       2
5   Max       3       2       2
6   Max       2       2       1

In [17]:
idlist = list(ids['ID'])
filter_d1 = data1['ID'].isin(idlist)
filter_d2 = data2['ID'].isin(idlist)

In [18]:
data2[filter_d2]

     ID  field1  field2  field3
4  Karl       1       4       2

In [19]:
pd.concat([data1[filter_d1], data2[filter_d2]])

     ID  field1  field2  field3
1  John       1       3       3
3  Karl       1       1       2
4  Karl       1       3       2
5  Karl       2       2       2
6  Andy       1       2       3
4  Karl       1       4       2